app/controllers/position_controller.rb

SELECT "positions".* FROM "positions" WHERE "positions"."user" = ?  [["user", 1]]
---
  def getPosition
  	@positions = (Position.where({user: current_user.id}).reverse)[0,10]

INSERT INTO "positions" ("user", "latitud", "longitud", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user", 1], ["latitud", 6.1410697], ["longitud", -75.60333829999999], ["created_at", "2018-07-21 03:19:54.968895"], ["updated_at", "2018-07-21 03:19:54.968895"]]
---
  def save
  	respond_to do |format|
	    latitud = params[:lat]
	    longitud = params[:lon]
	    puts "lon: "+longitud.to_str+" lat: "+latitud.to_str
	    @position = Position.new(user: current_user.id,latitud: latitud, longitud: longitud)
	    if @position.save